Emacs.org
*** Keybindings (=:leader= ~SPC-<Key>~)

#+begin_src emacs-lisp :tangle ./.doom.d/config.el

(map! :leader
      (:prefix-map ("b" . "buffer")
       :desc "Consult buffer" :n "j" #'consult-buffer
       :desc "Counsel switch buffer other window" :n "I" #'counsel-switch-buffer-other-window
       :desc "List bookmarks" "L" #'list-bookmarks
       :desc "Save current bookmarks to bookmark file" "w" #'bookmark-save)
      ;; (:prefix-map ("c" . "code"))
      ;; (:prefix-map ("d" . "dired"))
      ;; (:prefix-map ("f" . "file"))
      ;; (:prefix-map ("g" . "git"))
      ;; (:prefix-map ("h" . "help"))
      ;; (:prefix-map ("i" . "emoji"))
      ;; (:prefix-map ("m" . "org manage")
      ;;  (:prefix ("a" . "attatch"))
      ;;  (:prefix ("b" . "table"))
      ;;  (:prefix ("c" . "clock"))
      ;;  (:prefix ("d" . "date"))
      ;;  )
      ;; (:prefix-map ("o" . "open"))
      ;; (:prefix-map ("p" . "projectile"))
      ;; (:prefix-map ("q" . "quit"))
      ;; (:prefix-map ("s" . "search"))
      (:prefix ("t" . "toogle")
       :desc "Toggle line highlight in frame" "h" #'hl-line-mode
       :desc "Toggle line highlight globally" "H" #'global-hl-line-mode
       :desc "Toggle truncate lines" "t" #'toggle-truncate-lines
       )
      ;; (:prefix-map ("w" . "window"))
      ;; (:prefix-map ("TAB" . "workspace"))
      (:prefix-map ("n" . "notes")
       (:prefix ("r" . "roam")
       :desc "Toggle org-roam Buffer" :n "l" #'org-roam-buffer-toggle
       :desc "Capture new org-roam Node" :n "n" #'org-roam-capture
       :desc "Capture new org-mode Node" :n "n" #'org-roam-capture
       :desc "Find org-roam Node" :n "f" #'org-roam-node-find
       :desc "Insert org-roam Node" :n "i" #'org-roam-node-insert
       :desc "Complete org-roam " :n "c" #'org-roam-complete-at-point)
       )
      )

#+end_src

**** Evaluate Elisp Expressions (~SPC-e~)

Original by [[https://www.distrotube.com/][Derek Taylor]] (see [[https://gitlab.com/dwt1/dotfiles][dwt1/dotfiles]])

Changing some keybindings from their defaults to better fit with Doom Emacs, and to avoid conflicts with my window managers which sometimes use the control key in their keybindings.  By default, Doom Emacs does not use 'SPC e' for anything, so I choose to use the format 'SPC e' plus 'key' for these (I also use 'SPC e' for 'eww' keybindings).

| COMMAND         | DESCRIPTION                                    | KEYBINDING |
|-----------------+------------------------------------------------+------------|
| eval-buffer     | /Evaluate elisp in buffer/                       | SPC e b    |
| eval-defun      | /Evaluate the defun containing or after point/   | SPC e d    |
| eval-expression | /Evaluate an elisp expression/                   | SPC e e    |
| eval-last-sexp  | /Evaluate elisp expression before point/         | SPC e l    |
| eval-region     | /Evaluate elisp in region/                       | SPC e r    |

#+begin_src emacs-lisp :tangle ./.doom.d/config.el

(map! :leader
      (:prefix ("e". "evaluate/EWW")
       :desc "Evaluate elisp in buffer" :n "b" #'eval-buffer
       :desc "Evaluate defun" :n "d" #'eval-defun
       :desc "Evaluate elisp expression" :n "e" #'eval-expression
       :desc "Evaluate last sexpression" :n "l" #'eval-last-sexp
       :desc "Evaluate elisp in region" :n "r" #'eval-region))

#+end_src

**** Command Log (maybe other logs) (~SPC-l~)

#+begin_src emacs-lisp

(map! :leader
      (:prefix-map ("l" . "log")
       :desc "Command Log Mode" :n "c" #'global-command-log-mode
       :desc "CLM Buffer" :n "b" #'clm/toggle-command-log-buffer
       )
      )

#+end_src

*** Keybindings (=CTRL= ~C-<Key>~)

#+begin_src emacs-lisp :tangle ./.doom.d/config.el

(map! (:prefix-map ("C-w" . "window")
       :desc "evil-window-left" :n "<left>" #'evil-window-left
       :desc "evil-window-right" :n "<right>" #'evil-window-right
       :desc "evil-window-up" :n "<up>" #'evil-window-up
       :desc "evil-window-down" :n "<down>" #'evil-window-down
       )
 )
#+end_src

*** Color Theme

#+begin_src emacs-lisp :tangle ./.doom.d/config.el

(setq doom-theme 'doom-solarized-dark-high-contrast)

#+end_src

*** Font Face Configuration

#+begin_src emacs-lisp :tangle ./.doom.d/config.el

;; Set the font face based on platform
(pcase system-type
  ((or 'gnu/linux 'windows-nt 'cygwin)
   (set-face-attribute 'default nil
                       :font "Source Code Pro"
                       :weight 'regular
                       :height 140))
  ('darwin (set-face-attribute 'default nil :font "Liberation Mono for Powerline" :height 140)))

;; Set the fixed pitch face
(pcase system-type
  ((or 'gnu/linux 'windows-nt 'cygwin)
   (set-face-attribute 'fixed-pitch nil
                       :font "Source Code Pro"
                       :weight 'regular
                       :height 140))
  ('darwin (set-face-attribute 'fixed-pitch nil :font "Liberation Mono for Powerline" :height 140)))

;; Set the variable pitch face
(pcase system-type
  ((or 'gnu/linux 'windows-nt 'cygwin)
   (set-face-attribute 'variable-pitch nil
                       ;; :font "Cantarell"
                       :font "Ubuntu"
                       :height 185
                       :weight 'regular))
  ('darwin (set-face-attribute 'variable-pitch nil :font "Hiragino Sans" :height 150)))

#+end_src

*** Basic Emacs UI Enhancements
**** Line Numbers

#+begin_src emacs-lisp :tangle ./.doom.d/config.el

(setq display-line-numbers-type 'relative)

;; Disable Line Numbers for specific modes
(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src

**** Visible Bell

Disable the computer =beep= and activate a visual feedback instead.

#+begin_src emacs-lisp :tangle ./.doom.d/config.el

;; Set up the visible bell
(setq visible-bell t)

#+end_src

**** Enable Menu Bar

#+begin_src emacs-lisp :tangle ./.doom.d/config.el

(menu-bar-mode 1)

#+end_src

**** Resize Startup Window

#+begin_src emacs-lisp :tangle ./.doom.d/config.el

(defun jp/set-frame-size-according-to-resolution ()
  (interactive)
  (if window-system
  (progn
    ;; use 120 char wide window for largeish displays
    ;; and smaller 80 column windows for smaller displays
    ;; pick whatever numbers make sense for you
    (if (> (x-display-pixel-width) 1280)
           (add-to-list 'default-frame-alist (cons 'width 177))
           (add-to-list 'default-frame-alist (cons 'width 100)))
    ;; for the height, subtract a couple hundred pixels
    ;; from the screen height (for panels, menubars and
    ;; whatnot), then divide by the height of a char to
    ;; get the height we want
    (add-to-list 'default-frame-alist
         (cons 'height (/ (- (x-display-pixel-height) 120)
                             (frame-char-height)))))))

(jp/set-frame-size-according-to-resolution)

#+end_src

*** Additional Packages
**** Rainbow Mode

#+begin_src emacs-lisp :tangle ./.doom.d/config.el
(add-hook 'org-mode-hook (rainbow-mode))
#+end_src

**** PDF Tools

#+begin_src emacs-lisp :tangle ./.doom.d/config.el
(pdf-tools-install)
#+end_src

* Org Mode
** Org Configuration
*** Directories and Files

#+begin_src emacs-lisp :tangle ./.doom.d/config.el

(setq org-directory "~/org/"
      org-agenda-files '((concat org-directory "/Agenda.org")
                         (concat org-directory "/Tasks.org")
                         (concat org-directory "/Habits.org")
                         (concat org-directory "/Journal.org"))
      org-default-notes-file (concat org-directory "/Notes.org")
      org-clock-sound "~/sounds/ding.wav")

#+end_src

*** Org Roam (Zettelkasten)

#+begin_src emacs-lisp :tangle ./.doom.d/config.el

(require 'org-roam-protocol)    ; Enable org roam protocol for links (org-roam://...)

(setq org-roam-directory (file-truename "~/org/roam")   ; Set org-roam directory
      org-roam-dailies-directory (file-truename "~/org/roam/dailies")
      org-roam-v2-ack t)                                ; Disable Warning for org-roam v2

(add-hook 'org-mode-hook (lambda () (org-roam-setup))) ; Enable org-roam


#+end_src

** UI Configuration
*** Visual Feedback
**** Ellipsis symbol (folding)

#+begin_src emacs-lisp :tangle ./.doom.d/config.el

(setq org-ellipsis " ▼ ")

#+end_src
**** Visual Eenhancements

#+Begin_src emacs-lisp :tangle ./.doom.d/config.el

(defun jp/org-mode-setup ()
  (org-indent-mode)
  (mixed-pitch-mode 1)
  (visual-line-mode 1))

(add-hook 'org-mode-hook #'jp/org-mode-setup)

;;(add-hook 'org-mode-hook (lambda () (mixed-pitch-mode))) ; Enable mixed fonts (fixed/variable)

#+end_src

**** Hiding Emphasis Marker

Hiding some emphasis marker (* / = )  when using them to /highlight/ *text*.
Set this value to ~nil~ to display them again.

#+begin_src emacs-lisp :tangle ./.doom.d/config.el

(setq org-hide-emphasis-markers t)      ; Hides *strong* /italic/ =highlight= marker

#+end_src
**** Visual Fill Column (add spaces and center text)

#+begin_src emacs-lisp :tangle ./.doom.d/config.el

(defun jp/org-visual-fill-column ()
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(add-hook 'org-mode-hook #'jp/org-visual-fill-column)

#+end_src

**** Org Bullets

#+begin_src emacs-lisp :tangle ./.doom.d/config.el

(require 'org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))) ; Enable org-mode bullets

#+end_src

**** Font Configuration
***** Headings

#+begin_src emacs-lisp :tangle ./.doom.d/config.el

;; setting org headlines
(custom-set-faces
   '(org-level-1 ((t (:inherit outline-1 :height 1.2))))
   '(org-level-2 ((t (:inherit outline-2 :height 1.1))))
   '(org-level-3 ((t (:inherit outline-3 :height 1.0))))
   '(org-level-4 ((t (:inherit outline-4 :height 1.0))))
   '(org-level-5 ((t (:inherit outline-5 :height 1.0))))
  )

  #+end_src

***** Setting Text Fonts for Mixed Fixed Pitch

#+begin_src emacs-lisp :tangle ./.doom.d/config.el

;; Make sure org-indent face is available
(require 'org-indent)

;; Ensure that anything that should be fixed-pitch in Org files appears that way
(set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
(set-face-attribute 'org-table nil  :inherit 'fixed-pitch)
(set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
(set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
(set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
(set-face-attribute 'org-drawer nil :inherit 'fixed-pitch :foreground "SkyBlue4")

#+end_src

*** Tasks Appearance
