.doom.d/config.el
      (:prefix-map ("b" . "buffer")
       :desc "Counsel switch buffer" :n "j" #'counsel-switch-buffer
       :desc "Counsel switch buffer other window" :n "I" #'counsel-switch-buffer-other-window)
      (:prefix-map ("c" . "code"))
      (:prefix-map ("d" . "dired"))
      (:prefix-map ("f" . "file"))
      (:prefix-map ("g" . "git"))
      (:prefix-map ("h" . "help"))
      (:prefix-map ("i" . "emoji"))
      (:prefix-map ("m" . "org manage")
       (:prefix ("a" . "attatch"))
       (:prefix ("b" . "table"))
       (:prefix ("c" . "clock"))
       (:prefix ("d" . "date"))
       )
      (:prefix-map ("o" . "open"))
      (:prefix-map ("p" . "projectile"))
      (:prefix-map ("q" . "quit"))
      (:prefix-map ("s" . "search"))
      (:prefix-map ("t" . "toogle"))
      (:prefix-map ("w" . "window"))
      (:prefix-map ("TAB" . "workspace"))
      (:prefix-map ("n" . "notes")
       (:prefix ("r" . "roam")
       :desc "Toggle org-roam Buffer" :n "l" #'org-roam-buffer-toggle
       :desc "Capture new org-roam Node" :n "n" #'org-roam-capture
       :desc "Capture new org-mode Node" :n "n" #'org-roam-capture
       :desc "Find org-roam Node" :n "f" #'org-roam-node-find
       :desc "Insert org-roam Node" :n "i" #'org-roam-node-insert
       :desc "Complete org-roam " :n "c" #'org-roam-complete-at-point)
       )
      )

(map! (:prefix-map ("C-w" . "window")
       :desc "evil-window-left" :n "<left>" #'evil-window-left
       :desc "evil-window-right" :n "<right>" #'evil-window-right
       :desc "evil-window-up" :n "<up>" #'evil-window-up
       :desc "evil-window-down" :n "<down>" #'evil-window-down
       )
 )

(setq doom-theme 'doom-solarized-dark-high-contrast)

;; Set the font face based on platform
(pcase system-type
  ((or 'gnu/linux 'windows-nt 'cygwin)
   (set-face-attribute 'default nil
                       :font "Source Code Pro"
                       :weight 'regular
                       :height 140))
  ('darwin (set-face-attribute 'default nil :font "Fira Mono" :height 170)))

;; Set the fixed pitch face
(set-face-attribute 'fixed-pitch nil
                    :font "Source Code Pro"
                    :weight 'regular
                    :height 140)

;; Set the variable pitch face
(set-face-attribute 'variable-pitch nil
                    ;; :font "Cantarell"
                    :font "Ubuntu"
                    :height 185
                    :weight 'regular)

(setq display-line-numbers-type 'relative)

;; Set up the visible bell
(setq visible-bell t)

(menu-bar-mode 1)

(rainbow-mode)

(pdf-tools-install)

(setq org-directory "~/org/"
      org-agenda-files '("~/org/Agenda.org"
                         "~/org/Tasks.org"
                         "~/org/Habits.org"
                         "~/org/Journal.org")
      org-default-notes-file (concat org-directory "/Notes.org"))

(setq org-roam-directory (file-truename "~/org/roam")   ; Set org-roam directory
      org-roam-v2-ack t)                                ; Disable Warning for org-roam v2

(add-hook 'org-mode-hook (lambda () (org-roam-setup))) ; Enable org-roam

(setq org-ellipsis " ▼ ")

(setq org-hide-emphasis-markers t)      ; Hides *strong* /italic/ =highlight= marker

(defun jp/org-visual-fill-column ()
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(add-hook 'org-mode-hook #'jp/org-visual-fill-column)

(require 'org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))) ; Enable org-mode bullets

;; setting org headlines
(custom-set-faces
   '(org-level-1 ((t (:inherit outline-1 :height 1.2))))
   '(org-level-2 ((t (:inherit outline-2 :height 1.1))))
   '(org-level-3 ((t (:inherit outline-3 :height 1.0))))
   '(org-level-4 ((t (:inherit outline-4 :height 1.0))))
   '(org-level-5 ((t (:inherit outline-5 :height 1.0))))
  )

;; Make sure org-indent face is available
(require 'org-indent)

;; Ensure that anything that should be fixed-pitch in Org files appears that way
(set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
(set-face-attribute 'org-table nil  :inherit 'fixed-pitch)
(set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
(set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
(set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
(set-face-attribute 'org-drawer nil :inherit 'fixed-pitch :foreground "SkyBlue4")

(add-hook 'org-mode-hook (lambda () (mixed-pitch-mode))) ; Enable mixed fonts (fixed/variable)

(setq org-todo-keyword-faces '(
