.doom.d/config.el
                         ("EPIC" . (:foreground "DodgerBlue" :weight "bold"))
                         ("PROJ" . "DarkGreen")
                         ("TODO" . org-warning)
                         ("STRT" . "yellow")
                         ("WAIT" . (:foreground "yellow4" :weight "italic"))
                         ("HOLD" . (:foreground "red4"))
                         ("IDEA" . (:foreground "BlueViolet"))
                         ("KILL" . "red")
                         ("CANCELLED" . (:foreground "red3" :weight "bold"))
                         )
      )

(setq org-todo-keywords '(
                          (type "EPIC(e)" "PROJ(p)" "TODO(t)" "STRT(s)"
                                "WAIT(w)" "HOLD(h)" "IDEA(i)" "|"
                                "DONE(d)" "KILL(k)" "CANCELLED(c)")
                          (sequence "BACKLOG(b)" "PLAN(p)" "ACTIVE(a)"
                                    "REVIEW(r)" "WAIT(w@/!)" "HOLD(h)" "|"
                                    "COMPLETED(c)" "CANC(k@)")
                        )
      )

(setq org-capture-templates '(
                              ("t" "Todo" entry (file+headline "~/org/todo.org" "Tasks")
                               "* TODO %?\n %i\n %a")
                              ("e" "Epic" entry (file+headline "~/org/epic.org" "Epic")
                               "* EPIC %?\n %i\n %a")
                              ("j" "Journal Entries")
                              ("jj" "Journal" entry
                               (file+olp+datetree "~/org/Journal.org")
                               "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
                               ;; ,(jp/read-file-as-string "~/Notes/Templates/Daily.org")
                               :clock-in :clock-resume
                               :empty-lines 1)
                              ("jm" "Meeting" entry
                               (file+olp+datetree "~/org/Journal.org")
                               "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
                               :clock-in :clock-resume
                               :empty-lines 1)
                              )
      )

(setq org-agenda-custom-commands
     '(("d" "Dashboard"
       ((agenda "" ((org-deadline-warning-days 7)))
        (todo "BACKLOG"
          ((org-agenda-overriding-header "Backlog Tasks")))
        (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

      ("t" "All Todo Tasks"
       ((todo "TODO"
          ((org-agenda-overriding-header "Todo Tasks")))))

      ("W" "Work Tasks" tags-todo "+work-email")

      ;; Low-effort next actions
      ("e" tags-todo "+TODO=\"EPIC\"+Effort<15&+Effort>0"
       ((org-agenda-overriding-header "Low Effort Tasks")
        (org-agenda-max-todos 20)
        (org-agenda-files org-agenda-files)))

      ("w" "Workflow Status"
       ((todo "WAIT"
              ((org-agenda-overriding-header "Waiting on External")
               (org-agenda-files org-agenda-files)))
        (todo "REVIEW"
              ((org-agenda-overriding-header "In Review")
               (org-agenda-files org-agenda-files)))
        (todo "PLAN"
              ((org-agenda-overriding-header "In Planning")
               (org-agenda-todo-list-sublevels nil)
               (org-agenda-files org-agenda-files)))
        (todo "BACKLOG"
              ((org-agenda-overriding-header "Project Backlog")
               (org-agenda-todo-list-sublevels nil)
               (org-agenda-files org-agenda-files)))
        (todo "READY"
              ((org-agenda-overriding-header "Ready for Work")
               (org-agenda-files org-agenda-files)))
        (todo "ACTIVE"
              ((org-agenda-overriding-header "Active Projects")
               (org-agenda-files org-agenda-files)))
        (todo "COMPLETED"
              ((org-agenda-overriding-header "Completed Projects")
               (org-agenda-files org-agenda-files)))
        (todo "CANC"
              ((org-agenda-overriding-header "Cancelled Projects")
               (org-agenda-files org-agenda-files)))))))

(setq org-tag-alist
      '((:startgroup)
         ; Put mutually exclusive tags here
         (:endgroup)
         ("@errand" . ?E)
         ("@home" . ?H)
         ("@work" . ?W)
         ("agenda" . ?a)
         ("planning" . ?p)
         ("publish" . ?P)
         ("batch" . ?b)
         ("note" . ?n)
         ("idea" . ?i)))

    (setq org-refile-targets
      '(("Archive.org" :maxlevel . 1)
        ("Tasks.org" :maxlevel . 1)))

    ;; Save Org buffers after refiling!
    (advice-add 'org-refile :after 'org-save-all-org-buffers)

(require 'org-alert)

;; This is needed as of Org 9.2
(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("sh" . "src sh"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("sc" . "src scheme"))
(add-to-list 'org-structure-template-alist '("ts" . "src typescript"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("go" . "src go"))
(add-to-list 'org-structure-template-alist '("yaml" . "src yaml"))
(add-to-list 'org-structure-template-alist '("json" . "src json"))

(map! :leader
      (:prefix ("d" . "dired")
       :desc "Open dired" "d" #'dired
       :desc "Dired jump to current" "j" #'dired-jump)
      (:after dired
       (:map dired-mode-map
        :desc "Peep-dired image previews" "d p" #'peep-dired
        :desc "Dired view file" "d v" #'dired-view-file)))
